spec/cassettes/InvoicePayment_Success/_process/updates_invoice_as_paid_by_confirming_payment_in_stripe.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/accounts
    body:
      encoding: UTF-8
      string: type=standard
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/6.2.0
      Authorization:
      - Bearer sk_test_51EXIAiEQYiNu1q8E22PeN6N5pMswpv0Q5dwRApDrqfIuGvyoKTCX5KaKdWWIEZht8LjSF85v7lxPOKrxBFFs7vLp00QvWOAKgM
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"6.2.0","lang":"ruby","lang_version":"3.1.2 p20 (2022-04-12)","platform":"x86_64-darwin21","engine":"ruby","publisher":"stripe","uname":"Darwin
        gowsiks-MacBook-Pro.local 21.4.0 Darwin Kernel Version 21.4.0: Fri Mar 18
        00:45:05 PDT 2022; root:xnu-8020.101.4~15/RELEASE_X86_64 x86_64","hostname":"gowsiks-MacBook-Pro.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 07 Jul 2022 09:59:11 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2934'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Idempotency-Key:
      - bae57114-5f6a-4805-8162-a84fafc3ec72
      Original-Request:
      - req_jhC3iBXbrxs4mw
      Request-Id:
      - req_jhC3iBXbrxs4mw
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - '2019-03-14'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "acct_1LIrUI2RQef6BOJD",
          "object": "account",
          "business_profile": {
            "mcc": null,
            "name": null,
            "product_description": null,
            "support_address": null,
            "support_email": null,
            "support_phone": null,
            "support_url": null,
            "url": null
          },
          "business_type": null,
          "capabilities": {
          },
          "charges_enabled": false,
          "controller": {
            "is_controller": true,
            "type": "application"
          },
          "country": "US",
          "created": 1657187950,
          "default_currency": "usd",
          "details_submitted": false,
          "email": null,
          "external_accounts": {
            "object": "list",
            "data": [

            ],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/accounts/acct_1LIrUI2RQef6BOJD/external_accounts"
          },
          "future_requirements": {
            "alternatives": [

            ],
            "current_deadline": null,
            "currently_due": [

            ],
            "disabled_reason": null,
            "errors": [

            ],
            "eventually_due": [

            ],
            "past_due": [

            ],
            "pending_verification": [

            ]
          },
          "metadata": {
          },
          "payouts_enabled": false,
          "requirements": {
            "alternatives": [

            ],
            "current_deadline": null,
            "currently_due": [
              "business_profile.product_description",
              "business_profile.support_phone",
              "business_profile.url",
              "email",
              "external_account",
              "tos_acceptance.date",
              "tos_acceptance.ip"
            ],
            "disabled_reason": "requirements.past_due",
            "errors": [

            ],
            "eventually_due": [
              "business_profile.product_description",
              "business_profile.support_phone",
              "business_profile.url",
              "email",
              "external_account",
              "tos_acceptance.date",
              "tos_acceptance.ip"
            ],
            "past_due": [
              "external_account",
              "tos_acceptance.date",
              "tos_acceptance.ip"
            ],
            "pending_verification": [

            ]
          },
          "settings": {
            "bacs_debit_payments": {
            },
            "branding": {
              "icon": null,
              "logo": null,
              "primary_color": null,
              "secondary_color": null
            },
            "card_issuing": {
              "tos_acceptance": {
                "date": null,
                "ip": null
              }
            },
            "card_payments": {
              "decline_on": {
                "avs_failure": false,
                "cvc_failure": false
              },
              "statement_descriptor_prefix": null,
              "statement_descriptor_prefix_kanji": null,
              "statement_descriptor_prefix_kana": null
            },
            "dashboard": {
              "display_name": null,
              "timezone": "Etc/UTC"
            },
            "payments": {
              "statement_descriptor": null,
              "statement_descriptor_kana": null,
              "statement_descriptor_kanji": null
            },
            "payouts": {
              "debit_negative_balances": true,
              "schedule": {
                "delay_days": 2,
                "interval": "daily"
              },
              "statement_descriptor": null
            },
            "sepa_debit_payments": {
            }
          },
          "tos_acceptance": {
            "date": null,
            "ip": null,
            "user_agent": null
          },
          "type": "standard"
        }
    http_version:
  recorded_at: Thu, 07 Jul 2022 09:59:11 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/accounts
    body:
      encoding: UTF-8
      string: type=custom&country=US&email=jenny.rosen%40example.com&business_type=company&company[name]=test+company&business_profile[name]=test+company&business_profile[url]=https%3A%2F%2Fexampletest.com&capabilities[card_payments][requested]=true&capabilities[transfers][requested]=true
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/6.2.0
      Authorization:
      - Bearer sk_test_51EXIAiEQYiNu1q8E22PeN6N5pMswpv0Q5dwRApDrqfIuGvyoKTCX5KaKdWWIEZht8LjSF85v7lxPOKrxBFFs7vLp00QvWOAKgM
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_jhC3iBXbrxs4mw","request_duration_ms":3005}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"6.2.0","lang":"ruby","lang_version":"3.1.2 p20 (2022-04-12)","platform":"x86_64-darwin21","engine":"ruby","publisher":"stripe","uname":"Darwin
        gowsiks-MacBook-Pro.local 21.4.0 Darwin Kernel Version 21.4.0: Fri Mar 18
        00:45:05 PDT 2022; root:xnu-8020.101.4~15/RELEASE_X86_64 x86_64","hostname":"gowsiks-MacBook-Pro.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 07 Jul 2022 09:59:15 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '4412'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Idempotency-Key:
      - 11a69356-b734-4aac-845e-7c16c3ec1b63
      Original-Request:
      - req_7gdbIXMetSm2oO
      Request-Id:
      - req_7gdbIXMetSm2oO
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - '2019-03-14'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "acct_1LIrUL2SJXSlZzl2",
          "object": "account",
          "business_profile": {
            "mcc": null,
            "name": "test company",
            "product_description": null,
            "support_address": null,
            "support_email": null,
            "support_phone": null,
            "support_url": null,
            "url": "https://exampletest.com"
          },
          "business_type": "company",
          "capabilities": {
            "card_payments": "inactive",
            "platform_payments": "inactive"
          },
          "charges_enabled": false,
          "company": {
            "address": {
              "city": null,
              "country": "US",
              "line1": null,
              "line2": null,
              "postal_code": null,
              "state": null
            },
            "directors_provided": false,
            "executives_provided": false,
            "name": "test company",
            "owners_provided": false,
            "tax_id_provided": false,
            "verification": {
              "document": {
                "back": null,
                "details": null,
                "details_code": null,
                "front": null
              }
            }
          },
          "country": "US",
          "created": 1657187953,
          "default_currency": "usd",
          "details_submitted": false,
          "email": "jenny.rosen@example.com",
          "external_accounts": {
            "object": "list",
            "data": [

            ],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/accounts/acct_1LIrUL2SJXSlZzl2/external_accounts"
          },
          "future_requirements": {
            "alternatives": [

            ],
            "current_deadline": null,
            "currently_due": [

            ],
            "disabled_reason": null,
            "errors": [

            ],
            "eventually_due": [

            ],
            "past_due": [

            ],
            "pending_verification": [

            ]
          },
          "metadata": {
          },
          "payouts_enabled": false,
          "requirements": {
            "alternatives": [
              {
                "alternative_fields_due": [
                  "owners.verification.document"
                ],
                "original_fields_due": [
                  "owners.ssn_last_4"
                ]
              },
              {
                "alternative_fields_due": [
                  "representative.verification.document"
                ],
                "original_fields_due": [
                  "representative.ssn_last_4"
                ]
              }
            ],
            "current_deadline": null,
            "currently_due": [
              "business_profile.mcc",
              "company.address.city",
              "company.address.line1",
              "company.address.postal_code",
              "company.address.state",
              "company.phone",
              "company.tax_id",
              "external_account",
              "relationship.account_opener",
              "relationship.owner",
              "tos_acceptance.date",
              "tos_acceptance.ip"
            ],
            "disabled_reason": "requirements.past_due",
            "errors": [

            ],
            "eventually_due": [
              "business_profile.mcc",
              "company.address.city",
              "company.address.line1",
              "company.address.postal_code",
              "company.address.state",
              "company.phone",
              "company.tax_id",
              "external_account",
              "relationship.account_opener",
              "relationship.owner",
              "tos_acceptance.date",
              "tos_acceptance.ip"
            ],
            "past_due": [
              "business_profile.mcc",
              "company.address.city",
              "company.address.line1",
              "company.address.postal_code",
              "company.address.state",
              "company.phone",
              "company.tax_id",
              "external_account",
              "relationship.account_opener",
              "relationship.owner",
              "tos_acceptance.date",
              "tos_acceptance.ip"
            ],
            "pending_verification": [

            ]
          },
          "settings": {
            "bacs_debit_payments": {
            },
            "branding": {
              "icon": null,
              "logo": null,
              "primary_color": null,
              "secondary_color": null
            },
            "card_issuing": {
              "tos_acceptance": {
                "date": null,
                "ip": null
              }
            },
            "card_payments": {
              "decline_on": {
                "avs_failure": false,
                "cvc_failure": false
              },
              "statement_descriptor_prefix": null,
              "statement_descriptor_prefix_kanji": null,
              "statement_descriptor_prefix_kana": null
            },
            "dashboard": {
              "display_name": "Exampletest",
              "timezone": "Etc/UTC"
            },
            "payments": {
              "statement_descriptor": "EXAMPLETEST.COM",
              "statement_descriptor_kana": null,
              "statement_descriptor_kanji": null
            },
            "payouts": {
              "debit_negative_balances": false,
              "schedule": {
                "delay_days": 2,
                "interval": "daily"
              },
              "statement_descriptor": null
            },
            "sepa_debit_payments": {
            }
          },
          "tos_acceptance": {
            "date": null,
            "ip": null,
            "user_agent": null
          },
          "type": "custom"
        }
    http_version:
  recorded_at: Thu, 07 Jul 2022 09:59:15 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: UTF-8
      string: email=garret_kilback%40example.org&name=Garry+Bosco&phone=%2B96012494951872&metadata[platform_id]=1
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/6.2.0
      Authorization:
      - Bearer sk_test_51EXIAiEQYiNu1q8E22PeN6N5pMswpv0Q5dwRApDrqfIuGvyoKTCX5KaKdWWIEZht8LjSF85v7lxPOKrxBFFs7vLp00QvWOAKgM
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_7gdbIXMetSm2oO","request_duration_ms":3611}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"6.2.0","lang":"ruby","lang_version":"3.1.2 p20 (2022-04-12)","platform":"x86_64-darwin21","engine":"ruby","publisher":"stripe","uname":"Darwin
        gowsiks-MacBook-Pro.local 21.4.0 Darwin Kernel Version 21.4.0: Fri Mar 18
        00:45:05 PDT 2022; root:xnu-8020.101.4~15/RELEASE_X86_64 x86_64","hostname":"gowsiks-MacBook-Pro.local"}'
      Stripe-Account:
      - acct_1LIrUL2SJXSlZzl2
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 07 Jul 2022 09:59:16 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1269'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Idempotency-Key:
      - 6008b87a-83ad-46db-867d-36b3db98b165
      Original-Request:
      - req_vLm0JKw4kbYwmQ
      Request-Id:
      - req_vLm0JKw4kbYwmQ
      Stripe-Account:
      - acct_1LIrUL2SJXSlZzl2
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - '2019-03-14'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_M0tG1eJ707lcHc",
          "object": "customer",
          "account_balance": 0,
          "address": null,
          "balance": 0,
          "created": 1657187956,
          "currency": null,
          "default_source": null,
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "garret_kilback@example.org",
          "invoice_prefix": "0836CE77",
          "invoice_settings": {
            "custom_fields": null,
            "default_payment_method": null,
            "footer": null,
            "rendering_options": null
          },
          "livemode": false,
          "metadata": {
            "platform_id": "1"
          },
          "name": "Garry Bosco",
          "next_invoice_sequence": 1,
          "phone": "+96012494951872",
          "preferred_locales": [

          ],
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [

            ],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_M0tG1eJ707lcHc/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [

            ],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_M0tG1eJ707lcHc/subscriptions"
          },
          "tax_exempt": "none",
          "tax_ids": {
            "object": "list",
            "data": [

            ],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_M0tG1eJ707lcHc/tax_ids"
          },
          "tax_info": null,
          "tax_info_verification": null,
          "test_clock": null
        }
    http_version:
  recorded_at: Thu, 07 Jul 2022 09:59:16 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/checkout/sessions
    body:
      encoding: UTF-8
      string: line_items[0][price_data][currency]=inr&line_items[0][price_data][product_data][name]=bkxt&line_items[0][price_data][product_data][description]=Invoice+from+Saeloun+for+inr+20436.29+due+on+2021-04-03&line_items[0][price_data][unit_amount]=2043629&line_items[0][quantity]=1&mode=payment&customer=cus_M0tG1eJ707lcHc&success_url=https%3A%2F%2Fexample.com%2Finvoices%2F1%2Fpayments%2Fsuccess&cancel_url=https%3A%2F%2Fexample.com%2Finvoices%2F1%2Fpayments%2Fcancel
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/6.2.0
      Authorization:
      - Bearer sk_test_51EXIAiEQYiNu1q8E22PeN6N5pMswpv0Q5dwRApDrqfIuGvyoKTCX5KaKdWWIEZht8LjSF85v7lxPOKrxBFFs7vLp00QvWOAKgM
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_vLm0JKw4kbYwmQ","request_duration_ms":1404}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"6.2.0","lang":"ruby","lang_version":"3.1.2 p20 (2022-04-12)","platform":"x86_64-darwin21","engine":"ruby","publisher":"stripe","uname":"Darwin
        gowsiks-MacBook-Pro.local 21.4.0 Darwin Kernel Version 21.4.0: Fri Mar 18
        00:45:05 PDT 2022; root:xnu-8020.101.4~15/RELEASE_X86_64 x86_64","hostname":"gowsiks-MacBook-Pro.local"}'
      Stripe-Account:
      - acct_1LIrUL2SJXSlZzl2
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 07 Jul 2022 09:59:20 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1855'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Idempotency-Key:
      - 0bf31485-8cce-410d-88e9-0d42cf6ff54c
      Original-Request:
      - req_p2JAWyfHfqyZNZ
      Request-Id:
      - req_p2JAWyfHfqyZNZ
      Stripe-Account:
      - acct_1LIrUL2SJXSlZzl2
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - '2019-03-14'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cs_test_a1uY6cX8LOlUwzFzFgHcDlOKcHRi5RODFVkPnQhiseNREJ7WkmUzylE5LY",
          "object": "checkout.session",
          "after_expiration": null,
          "allow_promotion_codes": null,
          "amount_subtotal": 2043629,
          "amount_total": 2043629,
          "automatic_tax": {
            "enabled": false,
            "status": null
          },
          "billing_address_collection": null,
          "cancel_url": "https://example.com/invoices/1/payments/cancel",
          "client_reference_id": null,
          "consent": null,
          "consent_collection": null,
          "currency": "inr",
          "customer": "cus_M0tG1eJ707lcHc",
          "customer_creation": null,
          "customer_details": {
            "address": null,
            "email": "garret_kilback@example.org",
            "name": null,
            "phone": null,
            "tax_exempt": "none",
            "tax_ids": null
          },
          "customer_email": null,
          "expires_at": 1657274359,
          "livemode": false,
          "locale": null,
          "metadata": {
          },
          "mode": "payment",
          "payment_intent": "pi_3LIrUR2SJXSlZzl20ACOhpNK",
          "payment_link": null,
          "payment_method_options": {
          },
          "payment_method_types": [
            "card"
          ],
          "payment_status": "unpaid",
          "phone_number_collection": {
            "enabled": false
          },
          "recovered_from": null,
          "setup_intent": null,
          "shipping": null,
          "shipping_address_collection": null,
          "shipping_options": [

          ],
          "shipping_rate": null,
          "status": "open",
          "submit_type": null,
          "subscription": null,
          "success_url": "https://example.com/invoices/1/payments/success",
          "total_details": {
            "amount_discount": 0,
            "amount_shipping": 0,
            "amount_tax": 0
          },
          "url": "https://checkout.stripe.com/pay/cs_test_a1uY6cX8LOlUwzFzFgHcDlOKcHRi5RODFVkPnQhiseNREJ7WkmUzylE5LY#fidkdWxOYHwnPyd1blpxYHZxWktKYmZuSTFHUTE1ZGJibExXSGxQPUo3YjU1fG1UfXU0fFYnKSdjd2poVmB3c2B3Jz9xd3BgKSdpZHxqcHFRfHVgJz8ndmxrYmlgWmxxYGgnKSdga2RnaWBVaWRmYG1qaWFgd3YnP3F3cGApJ3Zxd2x1YERmZmpwa3EnPydkZmZxWjRJTHdQSTdWT11WaV9%2FaTcneCUl"
        }
    http_version:
  recorded_at: Thu, 07 Jul 2022 09:59:20 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/payment_intents/pi_3LIrUR2SJXSlZzl20ACOhpNK
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/6.2.0
      Authorization:
      - Bearer sk_test_51EXIAiEQYiNu1q8E22PeN6N5pMswpv0Q5dwRApDrqfIuGvyoKTCX5KaKdWWIEZht8LjSF85v7lxPOKrxBFFs7vLp00QvWOAKgM
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_p2JAWyfHfqyZNZ","request_duration_ms":3355}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"6.2.0","lang":"ruby","lang_version":"3.1.2 p20 (2022-04-12)","platform":"x86_64-darwin21","engine":"ruby","publisher":"stripe","uname":"Darwin
        gowsiks-MacBook-Pro.local 21.4.0 Darwin Kernel Version 21.4.0: Fri Mar 18
        00:45:05 PDT 2022; root:xnu-8020.101.4~15/RELEASE_X86_64 x86_64","hostname":"gowsiks-MacBook-Pro.local"}'
      Stripe-Account:
      - acct_1LIrUL2SJXSlZzl2
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 07 Jul 2022 09:59:21 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1489'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_RZERaQOBEKvqti
      Stripe-Account:
      - acct_1LIrUL2SJXSlZzl2
      Stripe-Version:
      - '2019-03-14'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "pi_3LIrUR2SJXSlZzl20ACOhpNK",
          "object": "payment_intent",
          "amount": 2043629,
          "amount_capturable": 0,
          "amount_details": {
            "tip": {
            }
          },
          "amount_received": 0,
          "application": "ca_LVTEicAhu0EntAfF62QG1G4CXJtN08Wv",
          "application_fee_amount": null,
          "automatic_payment_methods": null,
          "canceled_at": null,
          "cancellation_reason": null,
          "capture_method": "automatic",
          "charges": {
            "object": "list",
            "data": [

            ],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/charges?payment_intent=pi_3LIrUR2SJXSlZzl20ACOhpNK"
          },
          "client_secret": "pi_3LIrUR2SJXSlZzl20ACOhpNK_secret_OGqvNreKudMuXwP4xpOaRpSYH",
          "confirmation_method": "automatic",
          "created": 1657187959,
          "currency": "inr",
          "customer": "cus_M0tG1eJ707lcHc",
          "description": null,
          "invoice": null,
          "last_payment_error": null,
          "livemode": false,
          "metadata": {
          },
          "next_action": null,
          "on_behalf_of": null,
          "payment_method": null,
          "payment_method_options": {
            "card": {
              "installments": null,
              "mandate_options": null,
              "network": null,
              "request_three_d_secure": "automatic"
            }
          },
          "payment_method_types": [
            "card"
          ],
          "processing": null,
          "receipt_email": null,
          "review": null,
          "setup_future_usage": null,
          "shipping": null,
          "source": null,
          "statement_descriptor": null,
          "statement_descriptor_suffix": null,
          "status": "succeeded",
          "transfer_data": null,
          "transfer_group": null
        }
    http_version:
  recorded_at: Thu, 07 Jul 2022 09:59:21 GMT
recorded_with: VCR 3.0.3
